In [6]:
import pandas as pd

In [8]:
df = pd.read_csv("unisex_names.csv")
df.head()

   Unnamed: 0    name          total  male_share  female_share       gap
0           1   Casey  176544.328149    0.584287      0.415713  0.168573
1           2   Riley  154860.665173    0.507639      0.492361  0.015278
2           3  Jessie  136381.830656    0.477834      0.522166  0.044331
3           4  Jackie  132928.788740    0.421133      0.578867  0.157735
4           5   Avery  121797.419516    0.335213      0.664787  0.329574

In [9]:
df = df.drop('Unnamed: 0', axis=1)

In [10]:
df[:5]

     name          total  male_share  female_share       gap
0   Casey  176544.328149    0.584287      0.415713  0.168573
1   Riley  154860.665173    0.507639      0.492361  0.015278
2  Jessie  136381.830656    0.477834      0.522166  0.044331
3  Jackie  132928.788740    0.421133      0.578867  0.157735
4   Avery  121797.419516    0.335213      0.664787  0.329574

In [11]:
data = open("unisex_names.csv", "r")
#names = data.readlines()[11:]
names = data.read()

In [12]:
type(names)

str

#### 1. Convert the String to a List
Now that you have a string representation of the file, convert it to a list of strings.

In [15]:
# Now that you have a string representation of the file, convert it to a list of strings.

# Use the split() method that strings have to split on the new-line delimiter ("\n"), and assign the resulting list to names_list.
names_list = names.split('\n')

# Select the first five elements in names_list, and assign them to first_five.
first_five = names_list[:5]

print(first_five)

['"","name","total","male_share","female_share","gap"', '"1","Casey",176544.328149,0.584286566204162,0.415713433795838,0.168573132408324', '"2","Riley",154860.665173,0.507639071226889,0.492360928773111,0.0152781424537786', '"3","Jessie",136381.830656,0.47783426831522,0.52216573168478,0.04433146336956', '"4","Jackie",132928.78874,0.421132601798505,0.578867398201495,0.15773479640299']

In [17]:
# skip the first row - heading of columns
names_list = names_list[1:]

#### 2. Convert the List of Strings to a List of Lists
When you displayed the first five elements, you may have noticed that they contained commas. Let's split each string element in names_list on the comma, and add the resulting lists to a new list named nested_list.

In [19]:
nested_list = []
for names in names_list:
    comma_list = names.split(',')
    nested_list.append(comma_list)
#print(nested_list)

In [22]:
type(nested_list)

list

#### 3. Convert Numerical Values
You now have a list of lists assigned to nested_list, where each inner list contains string elements. The second element (the estimated number of people with that name) in each list is a decimal value that you should convert to a float. By converting these values to floats, you'll be able to perform computations on them and analyze the data.

Create an empty list and assign it to numerical_list.
Write a for loop that iterates over nested_list. In the loop body:
Retrieve the element at index 0 and assign it to a variable.
Retrieve the element at index 1, convert it to a float, and assign it to a variable.
Create a new list containing these two elements (in the same order).
Use the append() method to add this new list to numerical_list.
Finally, display the first five elements in numerical_list.

In [45]:
numerical_list = []
for item in nested_list[:919]:
    name = item[:1]
    #name = item[1]
    #total_name = float(item[2])
    #sub_list = [name, total_name]
    #numerical_list.append(sub_list)
#print(numerical_list[:5])

#### 4. Create a new list of strings called thousand_or_greater that only contains the names shared by 1,000 people or more.

In [27]:
thousand_or_greater = []
for names in numerical_list:
    population = names[1]
    name = names[0]
    if population >= 1000:
        thousand_or_greater.append(name)
#print(thousand_or_greater[:10])